package com.helper.birthday;

//存放星座特点
public class ConsStory {
	
	public static String[] STAR={
	
	//双鱼座
	"生于每年2月19日至3月20日，罚木星守护射手座与双鱼座。双鱼座的守护星为海王星。双鱼座是十二星座中最难评价的星座，" +
	"白羊的第一宫代表着开端，一切单纯的开始，而双鱼所掌管的第十二宫，即最后一宫，却集合了前十一宫的复杂。双鱼座的人通常不" +
	"归于实际派，而被认为是梦想家。但他们擅长理解和表达抽象的概念和系统，如果能将这种天生的能力运用于人性的观察，便是一大优势。" +
	"他们天真纯朴、有牺牲自我精神，是真理的信奉者（信仰或主义，也可以是宗教）；怜悯不幸的人，比任何星座都更能体会别人的难处；为受欺压者打抱不平，" +
	"厌恶欺人者，厌恶不平等的制度和态度；喜欢纯真的小孩和小动物，关心孤单的人，给他们温暖和鼓励。不过，双鱼须小心勿让人利用了他们的善良。",
		
	//白羊座
	"生于每年3月21日至4月20日，火星的本质为阳性，是天上火红色的天体，给人勇猛的感觉，" +
	"故此以战神阿瑞斯命名，象征勇气、刚强、斗志与男性魅力，掌管个人的冲劲与欲望，对群体具一定影响力。白羊座出生的人对新鲜的事物都很投入，并且勇于冒险，追求速度。白羊座给人精力旺盛和办事能力很强的印象，" +
	"脸部特征为轮廓深刻鲜明，额头和颧骨高耸，下巴结实有力，唇形紧闭。眉毛浓密，眼光锐利、直接，鼻子较长。性格善变；" +
	"是个天生的斗士，身手矫健。白羊座的人热情冲动、爱冒险、慷慨、天不怕地不怕，而且一旦下定决心，不到黄河心不死，" +
	"排除万难的要达到目的。大部分属于白羊座的人的脾气善变，而记仇的天蝎座便正好是白羊座的相反。"	,
	
	//金牛座
	"生于每年4月21日至5月20日，是在夏天之夜出现于银河西边的星座，金星是金牛座的守护星，所以金牛座是保守型的星座，" +
	"金牛座的人有艺术细胞，具有高度欣赏任何艺术的品味和能力。它守护神是爱与美的女神维纳斯。金牛座是保守型的星座，不喜欢变动" +
	"，安稳是他的生活态度。金牛座的人不会急躁冲动，只会忍耐，吃得苦中苦，方为人上人正是他们的写照，而且他们非常顽固，一旦决定的事，" +
	"不愿意去作任何改变。由于缺乏安全感，失业是金牛座最怕面对的问题，这代表他们失去生活的重心。金牛座男性有潜在的大男子主义倾向，" +
	"在家中不会多发言，但对尊严非常重视；金牛座女性一方面讲实际，一方面也喜爱打扮自己，因为金牛座的守护神就是爱与美的化身维纳斯。" +
	"他们通常属于慢热型，会花一段时间去适应一份感情，一份工作，一个环境，但适应之后，他们很少会改变自己，除非是迫不得已。",
	
	//双子座
	"生于每年5月21日至6月21日，水星移动的速度非常快，掌管个人的知识、沟通、推理，以及学习能力、处理困难时的机智、适应环境的能力" +
	"与个人意识，同时代表了时代转变时科技与学问对日常生活转变的影响。双子座的长相充满智慧而令人觉得生动有活力，椭圆形的脸型，十分柔和，" +
	"五官很少会过分夸张。弧形优美的眉毛下，是一双灵动好奇的眼睛，鼻梁瘦长，颧骨较高，下颚稍尖，生性轻浮善变，并有双重性格，但却因为多" +
	"才多艺且生气蓬勃，而深受异性垂青。",
	
	//巨蟹座
	"生于每年6月22日至7月22日月亮对个人感情的影响力大过太阳。在天象中，月亮的变化最大，有周期性的阴晴圆缺，代表情绪变化，感情起伏，" +
	"爱与恨的反覆出现。月亮代表支配我们的内在世界，是人性及本能的天象表现。巨蟹座的人生性多愁善感，有忧郁和作白日梦的倾向，他常会为过" +
	"去那段美好的日子而缅怀不已，并容易生活在过去的阴影中（水星的位置在巨蟹座时会加强这种性格）。为了私人利益，有时会过于大方，应避免" +
	"不必要的奢侈。巨蟹座的人易有极端的情绪化表现，他们的情绪阴晴不定，常会没来由地大发脾气，对别人的问话，也会随自己的高兴予以反驳或根" +
	"本拒绝回答；兴致好的时候，他却变成最佳的听众，充分发挥体谅、设想周到的优点。巨蟹座的人热爱事业，同时重情爱家，珍惜爱情，并真诚待友" +
	"。巨蟹座的人有包容心，一般不会为了一点芝麻小事而耿耿于怀，具有容人的雅量，很少拒人于千里之外，再加上其有礼貌、善交际、富幽默感之迷人" +
	"个性及对人道主义的尊崇，会有许多朋友。事实上巨蟹座的人经常会在强悍的外表下，隐藏着一颗柔弱的内心，他就像这星座的表征－－螃蟹，用硬如" +
	"铁甲的外壳将自己密密地武装起来，保护起自己最柔弱醉人的部分。但当你成为了他亲近的人，你将会感受他坚硬伪装下无尽温柔和默默付出所带来的温暖。",
	
	//狮子座
	"生于每年7月23日至8月22日，太阳是天象中影响力最大的天体，它是天地万物的中心，黄道就是太阳在天上运行的轨迹。太阳支配我们的外在世界，是" +
	"活力的泉源、战胜黑暗和疾病的力量、天地万物的依归。按照族训，身当紫金家族成员的狮子座，是欲望比较小的一颗星，对待事情不要太保守，在狮子" +
	"座沉稳的个性中要有所发迹，改造自己的同时把事业扩展到另外其他领域，继续坚持自己的耐性。狮子座的成员就类似火一样是一种充满热情的精英，狮" +
	"子座的成员拥有一颗永不输给任何生活体的火热的心。这样的狮子座的成员是一种对事情很轻易产生感情的精英，但重要的是找准一种目标，也就是找狮" +
	"子座的成员最感兴趣的事去做。另一方面，狮子座的成员是一种在艺术方面很有才华的精英，不论是绘画还是写作，狮子座的成员皆能展现独特的己方才华。",
	
	//处女座
	"生于每年8月23日至9月22日，水星守护双子座与处女座。处女座的人十分看重枝微末节，常为了小地方的完美而忽略了大局。水星的位置影响这种倾向" +
	"的强弱，例如若太阳的位置在处女座，水星的位置在狮子座时，则较能顾全大局优秀的处女座人不仅慎重且具有乐于助人的天性，他们具有服务精神，并" +
	"充分享受施予的乐趣。因为有一股来自精神的力量支撑其行动力，所以他们看起来总是忙得团团转，但却乐在其中。问题是他们很难放松心情去享受休闲" +
	"生活，要他停下来休息，受困扰的情况就像别人遇到难题一般。假如此星座的守护行星水星的位置在天平座时 ，就较能悠闲地享受空暇时光。水星虽然也" +
	"是双子座的守护行星，但处女座的人却不像双子座之轻躁浮夸。或许是因为这星座和“纯洁”脱离不了关系，处女座的人特别对人体的健康和卫生感到兴趣，" +
	"有许多是素食者，如若不然，也会对日常饮食力行 节制。",
	
	//天秤座
	"生于每年9月23日至10月23日，金星的本质为阴性，是天上金色的迷人天体，故此以爱神维纳斯命名，象征爱情与美丽，支配女性魅力与吸引异性的能力" +
	"，影响个人的审美眼光、美感、社交能力和价值观。天秤座的人温柔、娴雅，你需要欢欢乐乐地生活，需要忠贞不渝的友谊和爱情。随和与顺从是你性格上" +
	"的主要特点。无论对天秤座的男性还是女性，都可以看到这些难能可贵的女性品质，品格正直，平易近人，处处闪耀着人格魅力的光辉，以及你们所蕴藏的" +
	"艺术上的灵感和才华。这就是天秤座的人！天秤座出生的人举止言行十分注意分寸。和你相处既不可急躁，又不可简单粗暴，因为你的感情很难预测，高兴" +
	"起来有时忘乎所以。你对周围发生的一切都兴致勃勃，不仅知道事情的来龙去脉，而且还知道什么时机对成功最有利。天秤座的人最善于发现哪些人与你志" +
	"趣相投。",
	
	//天蝎座
	"生于每年10月24日至11月22日。是12星座中最神秘的星座。其守护星冥王星的本质为阳性，但其性质却是阴性，是天上米黄色的天体，给人以神秘智慧" +
	"的感觉。象征理性与女性魅力，掌管个人的目标与欲望，对群体具一定影响力。天蝎对于朋友，重质不重量，高度要求知心。宁可孤独，也不违心。对于爱" +
	"情，宁缺毋滥。宁可抱憾终生，也不苟且凑合。风流不羁的言行下，执着追求一种宗教意识的爱情信仰。内心具有高度责任性，忠诚性，自律性以及矛盾性。" +
	"浪漫儒雅，风趣超脱。拥有奇异诱人的容貌气质。 性质通常是神秘，果断，理性，消极，极端，多疑，富有判断力。天蝎大多恩怨分明，黑白绝不混肴。多" +
	"思少言的特质，齐全透彻的智慧，使一切真相假面恐慌不已。因此，本质静默孤僻的天蝎们极易招惹他人的非难和灌上莫须有的罪名。而其强硬又柔弱的本质" +
	"，常使其背负黑锅也不辩护，不低头。在忍无可忍时，天蝎才会真正采取报复行为。可也因其很多时候过于忍辱负重，好比老实人发火，报复也就更显突兀强" +
	"劲，反令圆滑的小人真正的祸首们恼羞成怒，借机大肆渲染。由于天蝎有隐忍为善的一面，更有别致的独特气质，从而也导致了天蝎备受他人嫉妒却常被反咬" +
	"一口的现象出现。也因为典型的天蝎，并不擅长疏通改善人际关系，更不善于有效地表达澄清自己，从而成为了十二星座里最具争议的一个星座。",
	
	//射手座
	"生于每年11月23日至12月21日，木星在中国及西洋星相学中同样被视为幸运星，代表天赋与灵性。由于木星每年经过一个星座，故又称为岁星，支配个人在" +
	"不同时期追求的领域。它亦代表法律与正义，支配善与恶、赏与罚。为人慷慨，待人友善令射手座并不缺乏朋友，乐观的天性、丰富的幽默感使得有他在地方必" +
	"定充满欢笑，不过若遇到难以解决或无法掌握的事时，那时缺乏耐性、做事冲动及不知三思而後行的特性即会表露无遗，长久下去可能性情急燥，宛如暴君一般" +
	"，令人有难以靠近之感。对于爱情，射手座较自我、主观、自在，常对恋人说：“爱我就给我自由。”也不试着了解对方的想法，虽是相当深情，但又要一有不满" +
	"意即不再接受，故恋爱来的快去亦快；爱得多离更多，可是却不会为分手而苦恼。",
	
	//摩羯座
	"生于每年12月22日至1月19日，土星是西洋占星术中唯一有光环的天体，绕黄道一周约需三十年，代表人生的起落。通常都很健壮，有过人的耐力、意志坚定" +
	"、有时间观念、有责任感、重视权威和名声，对领导统御很有一套，自成一格，另外组织能力也不错。摩羯座的人往往注重自身检查，对自己要求也特别严格，" +
	"却常常会因为疏漏或粗心犯些很不必要的错误。他们看上去虽然保守，但是其思想却很新潮的，他们喜欢接触与众不同的周边新奇事物，却往往不受外界感染，" +
	"总是能保持自己独有的特性。他们能在新的事物中去分析，并把分析的结果融会成一整套，以便知道怎么去应对他们。身为摩羯座的他们具有强烈的社会责任感，" +
	"他会认为世界上的一切不公正事情都有他的一部分原因，其表现总是一副忧心忡忡的样子。",
	
	//水瓶座
	"生于每年1月20日至2月18日，代表人生的起落，责任与负担、磨练与成长的方向。它是传统西洋占星术中变化最少的天体，所以也是顽固与耐性的象征，土星" +
	"支配个人的现实生活。守护星是天王星。水瓶座的人善于重新组织所有人的精神生活。是新思想的开拓者。追求属于自己独一无二的生活方式，是水瓶星座的生" +
	"活态度，但他又会偏向顽固的一面，有时令人捉摸不定，不过注重人道主义的水瓶座对人友善，亦都重视隐私，这一切一切皆由掌管水瓶座的天王星影响。创新、" +
	"多变、独立、倔强、反叛的水瓶座，究竟是什么的一个人？其实他们是很矛盾的一类人，不单外人看他们如是，连他们自己也感受到自己的矛盾。也是IQ最低星座。"
	
	};	
}

























